{
  "Mechanics & Systems": {
    "description": "Gameplay elements that define the mechanics and progression of the game.",
    "Combat Systems": {
      "description": "Types of combat mechanics used in the game."
    },
    "Combat Environments": {
      "description": "The types of environments where combat takes place."
    },
    "Combat Styles": {
      "description": "Different approaches and styles of combat."
    },
    "Movement": {
      "description": "The ways players can move within the game world."
    },
    "Structure": {
      "description": "The overall structure and flow of the game's levels and progression."
    },
    "Progression": {
      "description": "Mechanisms that allow players to improve or evolve their character or gameplay abilities."
    },
    "Challenges": {
      "description": "Different types of challenges the player faces throughout the game."
    },
    "Controls": {
      "description": "Ways players interact with the game through input devices."
    },
    "Economy Value": {
      "description": "The in-game systems related to resources, trade, and economy."
    },
    "Game Features": {
      "description": "Special features that enhance or alter the gameplay experience."
    },
    "RPGs": {
      "description": "Key elements of role-playing games, focused on gameplay."
    },
    "Puzzles": {
      "description": "Different puzzle mechanics found in the game."
    },
    "Shooters": {
      "description": "Different types of shooting gameplay mechanics."
    },
    "Sports": {
      "description": "Various types of sports games."
    },
    "Strategy": {
      "description": "Types of strategic gameplay and approaches."
    },
    "Simulation": {
      "description": "Mechanics that simulate real-life systems or activities."
    }
  },
  "Setting & World": {
    "description": "The environment, time period, and world-building aspects of the game.",
    "Time Periods": {
      "description": "Different time periods and historical eras in which the game takes place."
    },
    "Locations": {
      "description": "Various locations where the game takes place."
    },
    "Internet Culture": {
      "description": "Elements of internet culture embedded in the game world."
    },
    "Historical Events": {
      "description": "Real historical events that happened on a day or over a time period like wars, revolutions, assasinations, bombings, that form the backdrop or influence the game's world."
    },
    "Cultural Elements": {
      "description": "Cultural influences that shape the world or storyline of the game."
    },
    "Setting Conditions": {
      "description": "Overall conditions that define the world or setting of the game."
    },
    "Vehicles & Transportation": {
      "description": "Types of transportation and travel available within the game world including vehicles, animals, creatures and other devices."
    },
    "Entertainment Franchises": {
      "description": "Well-known entertainment franchises like movies, books and series that the game is part of."
    },
    "Environmental Features": {
      "description": "Specific natural and man made landscape and infrastructure features in the game world."
    }
  },
  "Aesthetics & Style": {
    "description": "Visual and auditory design elements that define the game's atmosphere and art direction.",
    "Art Styles": {
      "description": "Different visual art styles that the game uses."
    },
    "Visual Themes": {
      "description": "Themes that represent the game's overall aesthetic."
    },
    "Atmosphere": {
      "description": "The emotional and atmospheric tone the game conveys through visuals, pace and music."
    },
    "Sound Design": {
      "description": "The sound elements, instruments and musical style that define the game's auditory experience."
    },
    "Narrative Tone": {
      "description": "The emotional tone of the narrative or story presented in the game."
    }
  }
}